{
  "className": "Matrix_Class",
  "url": "https://docs.derivative.ca/Matrix_Class",
  "content": {
    "title": "Matrix Class",
    "items": {
      "toc": {
        "title": "Contents\n1 Instantiators\n2 Members\n3 Methods\n3.1 Special Functions",
        "content": ""
      },
      "toctogglecheckbox": {
        "title": "",
        "content": "Contents 1 Instantiators\n2 Members\n3 Methods\n3.1 Special Functions"
      },
      "mw-toc-heading": {
        "title": "Contents",
        "content": "1 Instantiators\n2 Members\n3 Methods\n3.1 Special Functions"
      },
      "Instantiators": {
        "title": "Instantiators",
        "content": ""
      },
      "vals": {
        "title": "",
        "content": "vals → float : Get or set the set of Matrix values."
      },
      "Members": {
        "title": "Members",
        "content": ""
      },
      "rows": {
        "title": "",
        "content": "rows → list of lists (Read Only): The list of Matrix rows, each a list of values."
      },
      "cols": {
        "title": "",
        "content": "cols → list of lists (Read Only): The list of Matrix columns, each a list of values."
      },
      "Methods": {
        "title": "Methods",
        "content": ""
      },
      "transpose": {
        "title": "",
        "content": "transpose()→ None: Transpose the values in the matrix.\nm.transpose() # m now contains the transpose of the matrix"
      },
      "getTranspose": {
        "title": "",
        "content": "getTranspose()→ None: Returns the transpose of the matrix, leaving the matrix itself unchanged.\nm2 = m.getTranspose()"
      },
      "invert": {
        "title": "",
        "content": "invert()→ None: Inverts the values in the matrix.\nm.invert() # m now contains the inverse of the matrix"
      },
      "getInverse": {
        "title": "",
        "content": "getInverse()→ tdu.Matrix: Returns the inverse of the matrix, leaving the matrix itself unchanged.\nm2 = m.getInverse()"
      },
      "determinant": {
        "title": "",
        "content": "determinant()→ float: Returns the determinant of the matrix.\nl = m.determinant()"
      },
      "mapUnitSquareToQuad": {
        "title": "",
        "content": "mapUnitSquareToQuad(blX, blY, brX, brY, tlX, tlY, trX, trY)→ None: Set the matrix to be a projection matrix that maps coordinates from to a unit square (0,0) -> (1,1) space to a space defined by an arbitrary quadrilateral (blX, blY) -> (trX, trY). The 4 corners of the quadrilateral are given ('bl' means bottom left, 'tr' means top right etc.)."
      },
      "mapQuadToUnitSquare": {
        "title": "",
        "content": "mapQuadToUnitSquare(blX, blY, brX, brY, tlX, tlY, trX, trY)→ None: Is the inverse of mapUnitSquareToQuad(). Mapping coordinates in an arbitrary quadrilateral into a space defined by the unit square."
      },
      "fillTable": {
        "title": "",
        "content": "fillTable(tableDAT)→ None: Fill in the contents of a table from the matrix which the method is called upon.\ntableDAT - The table to be filled."
      },
      "numpyArray": {
        "title": "",
        "content": "numpyArray()→ numpy.array: Returns this matrix as a 4x4 NumPy array."
      },
      "identity": {
        "title": "",
        "content": "identity()→ None: Replaces the values in the matrix with the identity matrix.\nm.identity() # now contains the identity matrix"
      },
      "copy": {
        "title": "",
        "content": "copy()→ tdu.Matrix: Returns a new matrix that is a copy of the matrix.\nnewM = m.copy() # newM will have the same values as m, m is unchanged"
      },
      "translate": {
        "title": "",
        "content": "translate(tx, ty, tz, fromRight=False)→ None: Multiplies the current matrix by a new translation matrix created from tx, ty and tz. The translation is applied from the left of the matrix by default. That is to say, if T is the new translation matrix, and M is the current matrix, then the result of this operation is M = T * M.\ntx, ty, tz - The translation value in each axis.\nfromRight - (Keyword, Optional) If True, the translation matrix will be multiplied from the right instead of the left.m = tdu.Matrix()\nm.translate(5, 0, 10)"
      },
      "rotate": {
        "title": "",
        "content": "rotate(rx, ry, rz, fromRight=False, pivot=None)→ None: Multiplies the current matrix by 3 rotation matrices, first a rotation around the X axis by rx degrees, followed by a rotation around the Y axis by ry degrees, followed by the same for rz. The rotation values are in degrees. The rotation is applied from the left of the matrix by default. So if M is the current matrix, then the result of this operation is M = RZ * RY * RX * M.\nrx, ry, rz - The rotation value around each X, Y and Z axis. The value is in degrees. The rotation is applied in XYZ order.\nfromRight - (Keyword, Optional) If True, the rotation matrix will be multiplied from the right instead of the left. In this case the operation is M = M * RZ * RY * RX.\npivot - (Keyword, Optional) If given, the rotation will be applied around the given pivot. The pivot should be a Vector, Position or a list with 3 entries.m = tdu.Matrix()\nm.rotate(45, 0, 0)\n\nm = tdu.Matrix()\nm.rotate(0, 0, 90, pivot=[0, 5, 0])\n\nm = tdu.Matrix()\np = tdu.Position(0, 5, 0)\nm.rotate(0, 90, 0, pivot=p)"
      },
      "rotateOnAxis": {
        "title": "",
        "content": "rotateOnAxis(rotationAxis, angle, fromRight=False, pivot=None)→ None: Multiplies the current matrix by a new rotation matrix created by rotation angle degrees around the axis specified by rotationAxis. The angle is in degrees. The rotation is applied from the left of the matrix by default. That is to say, if R is the new rotation matrix specified by rotationAxis and angle, and M is the current matrix, then the result of this operation is M = R * M.\nrotationAxis - A axis to rotate around. This should be a Vector or a list with 3 entries. It does not need to be normalized.\nangle - The amount to rotate around the axis, specified in degrees.\nfromRight - (Keyword, Optional) If True, the rotation matrix will be multiplied from the right instead of the left.\npivot - (Keyword, Optional) If given, the rotation will be applied around the given pivot. The pivot should be a Vector, Position or a list with 3 entries."
      },
      "scale": {
        "title": "",
        "content": "scale(sx, sy, sz, fromRight=False, pivot=None)→ None: Multiplies the current matrix by a scale matrix created from sx, sy and sz. The scale is applied from the left of the matrix by default. That is to say, if S is the new scale matrix, and M is the current matrix, then the result of this operation is M = S * M.\nsx, sy, sz - The scale value along each X, Y and Z axis.\nfromRight - (Keyword, Optional) If True, the scale matrix will be multiplied from the right instead of the left.\npivot - (Keyword, Optional) If given, the scale will be applied around the given pivot. The pivot should be a Vector, Position or a list with 3 entries.m = tdu.Matrix()\nm.scale(2, 1, 1)\n\nm = tdu.Matrix()\nm.scale(2, 1, 2, pivot=[0, 5, 0])\n\nm = tdu.Matrix()\np = tdu.Position(0, 5, 0)\nm.scale(1, 2, 1, pivot=p)"
      },
      "lookat": {
        "title": "",
        "content": "lookat(eyePos, target, up)→ None: Multiplies the current matrix by a lookat matrix created using the given values to the matrix. The lookat matrix is applied from the left of the matrix by default. That is to say, if L is the new lookat matrix, and M is the current matrix, then the result of this operation is M = L * M. The values for to parameters can be given as anything that can be treated as a list of 3 values. E.g a tdu.Vector, tdu.Position or simply a list of size 3.\neyePos - The position in space of the eye/camera.\ntarget - The position in space that should be looked at, from the eyePos.\nup - The Up vector. Ensure the up vector isn't pointing in the same direction as the lookat direction.m = tdu.Matrix()\neyeP = tdu.Position(0, 0, -5)\ntarget = tdu.Position(0, 5, 5)\nup = tdu.Position(0, 1, 0)\nm.lookat(eyeP, target, up)"
      },
      "decompose": {
        "title": "",
        "content": "decompose()→ Tuple(Tuple, Tuple, Tuple): Decomposes the matrix into its scale, rotate and translate values. These are the same as the translate, rotate and scale that are in the Geometry COMP and other Object components. However due to rotations being able to be solved in different ways, it's likely a decomposed transform matrix from a Geometry COMP will not have the same values as its parameter. The resulting transform is the same though. This function returns a tuple of tuples (3 tuples), which are the scale, rotate and translate values respectively.\ns, r, t = m.decompose()"
      },
      "projectionFrustum": {
        "title": "",
        "content": "projectionFrustum(left, right, bottom, top, near, far)→ None: Replaces the contents of the matrix with a projection matrix using the given frustum extents. The left, right, bottom, top extents are located on the near plane. The depth range generated by this matrix will be [0,1] from near to far, as is required by Vulkan."
      },
      "projectionFovX": {
        "title": "",
        "content": "projectionFovX(fovX, aspectX, aspectY, near, far)→ None: Replaces the contents of the matrix with a projection matrix defined by the FOV(given in degrees), an aspect ratio and near/far planes.  The depth range generated by this matrix will be [0,1] from near to far, as is required by Vulkan.\nfovX - The horizontal FOV, specified in degrees.\naspectX, aspectY - The aspect ration values. These can be something like 16 and 9 for an aspect or the render resolution such as 1920 and 1080. The results will be the same for the same ratio."
      },
      "projectionStereo": {
        "title": "",
        "content": "projectionStereo(ipd, convergeZ, fovX, aspectX, aspectY, near, far, rightEye = false)→ None: Replaces the contents of the matrix with an asymetrical projection matrix suitable for stereo rendering. The left eye's projection matrix is given by default, set rightEye=True to get the right eye's instead. For proper rendering, the cameras will also need to be translated in X by -ipd/2 and +ipd/2 for the left and right eyes respectively.  The depth range generated by this matrix will be [0,1] from near to far, as is required by Vulkan.\nipd - Interpupillary distance of the user, generally specified in meters. Typically between 0.05 and 0.08\ncovergeZ - distance in Z from the camera where the stereo convergence should occur, in the same units as ipd.\nfovX - The field of view in the X direction, in degrees.\naspectX, aspectY - The aspect ratio values. These can be something like 16 and 9 for an aspect or the render resolution such as 1920 and 1080. The results will be the same for the same ratio.\nnear, far - The near and far plane distances.\nrightEye - (Keyword, Optional) If set to True, the matrix will contain the projection for the right eye, otherwise it will contain the projection for the left eye."
      },
      "Special_Functions": {
        "title": "Special Functions",
        "content": "[edit]"
      },
      "[]": {
        "title": "",
        "content": "[row, column]→ float: Gets or sets the specified entry in the matrix.\ntx = m[0, 3]\nm[0, 3] = tx + 5"
      },
      "*": {
        "title": "",
        "content": "Matrix * Matrix→ tdu.Matrix: Performs a matrix multiplication returns the results in a new matrix.\nnewM = m1 * m2"
      },
      "-": {
        "title": "",
        "content": "Matrix - Matrix→ tdu.Matrix: Subtracts the matrices, component-by-component, and returns the results in a new matrix."
      },
      "+": {
        "title": "",
        "content": "Matrix + Matrix→ tdu.Matrix: Adds the matrices, component-by-component, and returns the results in a new matrix"
      },
      "*v": {
        "title": "",
        "content": "tdu.Matrix * tdu.Vector→ tdu.Vector: Multiplies the vector by the matrix and returns the a new vector as the result. Since a Vector is direction only and has no notion of a position, the translate part of the matrix does not get applied to the vector.\nnewV = M * v"
      },
      "*p": {
        "title": "",
        "content": "tdu.Matrix * tdu.Position→ tdu.Position: Multiplies the position by the matrix and returns the a new position as the result. If the matrix was not an transformation matrix, such as a projection matrix instead, the perspective divide by W will automatically be applied to X, Y and Z.\nnewP = M * p TouchDesigner Build: Latest\\nwikieditorwikieditorwikieditorwikieditorwikieditorwikieditorwikieditorwikieditorwikieditorwikieditorwikieditormw-rollbackmw-revertedmw-revertedmw-reverted2022.241402021.100002018.28070before 2018.28070"
      }
    }
  }
}