{
  "className": "PanelCOMP_Class",
  "url": "https://docs.derivative.ca/PanelCOMP_Class",
  "content": {
    "title": "PanelCOMP Class",
    "items": {
      "toc": {
        "title": "Contents\n1 Members\n2 Methods\n3 COMP Class\n3.1 Members\n3.1.1 Privacy\n3.1.2 Connection\n\n3.2 Methods\n3.2.1 Custom Parameters\n3.2.2 Privacy\n3.2.3 Component Variables\n\n\n4 OP Class\n4.1 Members\n4.1.1 General\n4.1.2 Common Flags\n4.1.3 Appearance\n4.1.4 Connection\n4.1.5 Cook Information\n4.1.6 Type\n\n4.2 Methods\n4.2.1 General\n4.2.2 Errors\n4.2.3 Appearance\n4.2.4 Viewers\n4.2.5 Storage\n4.2.6 Miscellaneous",
        "content": ""
      },
      "toctogglecheckbox": {
        "title": "",
        "content": "Contents 1 Members\n2 Methods\n3 COMP Class\n3.1 Members\n3.1.1 Privacy\n3.1.2 Connection\n\n3.2 Methods\n3.2.1 Custom Parameters\n3.2.2 Privacy\n3.2.3 Component Variables\n\n\n4 OP Class\n4.1 Members\n4.1.1 General\n4.1.2 Common Flags\n4.1.3 Appearance\n4.1.4 Connection\n4.1.5 Cook Information\n4.1.6 Type\n\n4.2 Methods\n4.2.1 General\n4.2.2 Errors\n4.2.3 Appearance\n4.2.4 Viewers\n4.2.5 Storage\n4.2.6 Miscellaneous"
      },
      "mw-toc-heading": {
        "title": "Contents",
        "content": "1 Members\n2 Methods\n3 COMP Class\n3.1 Members\n3.1.1 Privacy\n3.1.2 Connection\n\n3.2 Methods\n3.2.1 Custom Parameters\n3.2.2 Privacy\n3.2.3 Component Variables\n\n\n4 OP Class\n4.1 Members\n4.1.1 General\n4.1.2 Common Flags\n4.1.3 Appearance\n4.1.4 Connection\n4.1.5 Cook Information\n4.1.6 Type\n\n4.2 Methods\n4.2.1 General\n4.2.2 Errors\n4.2.3 Appearance\n4.2.4 Viewers\n4.2.5 Storage\n4.2.6 Miscellaneous"
      },
      "Members": {
        "title": "Members",
        "content": ""
      },
      "panel": {
        "title": "",
        "content": "panel → td.Panel (Read Only): The Panel from which Panel Values and the PanelValue Class may be accessed. (The second form is usually sufficient.)\nv = op('button1').panel.u.val\nv = op('button1').panel.u"
      },
      "panelRoot": {
        "title": "",
        "content": "panelRoot → OP (Read Only): The panelCOMP at the top of the panel hierarchy."
      },
      "panelChildren": {
        "title": "",
        "content": "panelChildren → list (Read Only): The children panelCOMPs of this operator."
      },
      "x": {
        "title": "",
        "content": "x → int (Read Only): The panel's x coordinate, as measured in pixels."
      },
      "y": {
        "title": "",
        "content": "y → int (Read Only): The panel's y coordinate, as measured in pixels."
      },
      "width": {
        "title": "",
        "content": "width → int (Read Only): The panel's width, as measured in pixels."
      },
      "height": {
        "title": "",
        "content": "height → int (Read Only): The panel's height, as measured in pixels."
      },
      "marginX": {
        "title": "",
        "content": "marginX → int (Read Only): The panel's x coordinate adjusted by margins as measured in pixels."
      },
      "marginY": {
        "title": "",
        "content": "marginY → int (Read Only): The panel's y coordinate adjusted by margins, as measured in pixels."
      },
      "marginWidth": {
        "title": "",
        "content": "marginWidth → int (Read Only): The panel's width adjusted by margins, as measured in pixels."
      },
      "marginHeight": {
        "title": "",
        "content": "marginHeight → int (Read Only): The panel's height adjusted by margins, as measured in pixels."
      },
      "dropReady": {
        "title": "",
        "content": "dropReady → bool (Read Only): The current state of the drop operation. True when the drop will be accepted."
      },
      "Methods": {
        "title": "Methods",
        "content": ""
      },
      "panelParent": {
        "title": "",
        "content": "panelParent(n)→ OP | None: The nth panel parent of this operator.  If n not specified, returns the panel parent. If n = 2, returns the parent of the parent, etc. If no panel parent exists at that level, None is returned.  A panel parent is the panel wired to the input of this operator, or if that does not exist, the panel containing this operator.\nn - (Optional) n is the number of levels up to climb. When n = 1 it will return the operator's panel parent.p = me.panelParent(2) #grandfather"
      },
      "interactMouse": {
        "title": "",
        "content": "interactMouse(u, v, leftClick=0, middleClick=0, rightClick=0, left=False, middle=False, right=False, wheel=0, pixels=False, Screen=False, quiet=True)→ PanelCOMP: Simulates virtual mouse clicks, rollovers, moves and drags on a panel. It will also update the panel values: inside, insideu, insidev, state, u and v, in panels all the way up to the parent panel. The first (primary) mouse down/touch on a panel takes precedence over subsequent mouse downs and touches, and overrides any hovers. The primary state on a panel is global as each panel can only have one interaction updating its state.\nu - The first coordinate for the click to occur at.\nv - The second coordinate for the click to occur at.\nleftClick, middleClick, rightClick -  (Keyword, Optional) Use to specify the number of times a button is clicked on\nleft, middle, right -  (Keyword, Optional) Use to specify if the button is being pressed.  When set to False it simulates a mouse move with the button up.  The first time the button is set to True will initiate a virtual mouse down on the child panel at the coordinates u,v.  Subsequent True states will simulate a drag (mouse button down and moving).  Simulate a mouse-up by calling the button set to False, e.g. left=False.\nwheel -  (Keyword, Optional) Roll the mouse wheel\npixels - (Keyword, Optional) When True, the coordinates are treated as pixel offsets.  When False, they are treated as normalized values.\nscreen - (Keyword, Optional) When True, the coordinates are relative to the screen. When False, they are relative to the calling container.\nquiet - (Keyword, Optional) When False, print warning messages, such as starting a mouse-down-move on a panel that is already being moved (dragged).\naux - (Keyword, Optional) Auxiliary data.op('container1').interactMouse(0.5, 0.5) # roll over the middle of container1\nop('container1').interactMouse(0.5, 0.5, leftClick=2) # double click the middle of container1\nop('container1').interactMouse(0.5, 0.5, left=True) # left mouse down on the middle of container1\nop('container1').interactMouse(0.6, 0.6, left=True) # move with left mouse down in container1\nop('container1').interactMouse(0.6, 0.6) # mouse up\nop('container1').interactMouse(0.5, 0.5, wheel=0.3) # roll the mouse wheel in the middle of container1\nop('container1').interactMouse(10, 20, pixels=True) # send a mouse event 10 pixels to the right, and 20 pixels above the lower left corner of container1"
      },
      "interactTouch": {
        "title": "",
        "content": "interactTouch(u, v, hover='id', start='id', move='id', end='id', pixels=False, screen=False, quiet=True, aux='data')→ PanelCOMP: Simulates virtual multiple touches and hovers on a panel via user assigned id. It will also update the panel values: inside, insideu, insidev, state, u and v, in panels all the way up to the parent panel. The first (primary) mouse down/touch on a panel takes precedence over subsequent mouse downs and touches, and overrides any hovers. The primary state on a panel is global.\nu - The first coordinate for the click to occur at.\nv - The second coordinate for the click to occur at.\nhover - (Keyword, Optional) Indicates a hover performed by the touch identifiable by 'id'.  If 'id' is used by a touch, the touch is ended.  If the <u,v> is out of bounds, the hover will end.\nstart - (Keyword, Optional) Start a touch identifiable by 'id'.  If 'id' is already touching or hovering, the action is ended and a new touch is started.\nmove - (Keyword, Optional) Move a touch identifiable by 'id'.  Nothing happens if 'id' is not found.\nend - (Keyword, Optional) End a touch identifiable by 'id'.  Nothing happens if 'id' is not found.\npixels - (Keyword, Optional) When True, the coordinates are treated as pixel offsets.  When False, they are treated as normalized values.\nscreen - (Keyword, Optional) When True, the coordinates are relative to the screen. When False, they are relative to the calling container.\nquiet - (Keyword, Optional) Print warning messages, such as starting a touch down on a panel that already has a touch.op('container1').interactTouch(0.5, 0.5, hover='finger') # roll over the middle of container1\nop('container1').interactTouch(0.5, 0.5, start='finger') # ends the hover and start a touch\nop('container1').interactTouch(0.7, 0.5, move='finger') # move the touch\nop('container1').interactTouch(0.3, 0.4, start='finger') # ends the previous touch and start a new touch\nop('container1').interactTouch(-1, -1, hover='finger') # ends the previous touch, and end any rollover state"
      },
      "interactClear": {
        "title": "",
        "content": "interactClear()→ None: Terminates any existing interactions. Touch or mouse interactions will end. Panels that are hovered over will end their rollover state."
      },
      "interactStatus": {
        "title": "",
        "content": "interactStatus()→ list: Returns a list of panel interactions.  Each interaction is encapsulated in a list as follows: [id, panel, state, primary].\nid - The unique string identifying the interaction.  '__MOUSE__' is used if the interaction was established via interactMouse.\npanel - The child panel being interacted with .\nstate - Interaction types 'hover' or 'touch'.\nprimary - True if the interaction is the first to act on the panel.op('container1').interactStatus  # list the current hover over a slider and 2 touches over a button in container1\n[['touch1', type:sliderCOMP path:/project1/container1/slider1, 'hover', False],\n['__MOUSE__', type:buttonCOMP path:/project1/container1/button1, 'touch', True],\n['touch2', type:buttonCOMP path:/project1/container1/button1, 'touch', False]]"
      },
      "locateMouse": {
        "title": "",
        "content": "locateMouse()→ Tuple[float, float]: Returns a tuple containing the mouse coordinates relative to the Panel Component. If the mouse is not over a window containing the panel, None is returned instead."
      },
      "locateMouseUV": {
        "title": "",
        "content": "locateMouseUV()→ Tuple[float, float]: Returns a tuple containing the normalized mouse coordinates relative to the Panel Component. If the mouse is not over a window containing the panel, None is returned instead."
      },
      "setFocus": {
        "title": "",
        "content": "setFocus(moveMouse=False)→ None: Set the hierarchical focus to this component, which sets the Panel value focusselect to 1. Focus will only be set successfully if the panel is open.\nmoveMouse - (Keyword, Optional) If set to True, the mouse will be moved to the component as well."
      },
      "COMP_Class": {
        "title": "COMP Class",
        "content": "[edit]"
      },
      "Members_2": {
        "title": "Members",
        "content": ""
      },
      "extensions": {
        "title": "",
        "content": "extensions → List (Read Only): A list of extensions attached to this component."
      },
      "extensionsReady": {
        "title": "",
        "content": "extensionsReady → Bool (Read Only): True unless the extensions are currently compiling. Can be used to avoid accessing promoted members prematurely during an extension initialization function."
      },
      "internalOPs": {
        "title": "",
        "content": "internalOPs → Dict (Read Only): A dictionary of internal operator shortcuts found in this component. See also OP.iop"
      },
      "internalPars": {
        "title": "",
        "content": "internalPars → Dict (Read Only): A dictionary of internal parameters shortcuts found in this component. See also OP.ipar"
      },
      "clones": {
        "title": "",
        "content": "clones → List (Read Only): A list of all components cloned to this component."
      },
      "componentCloneImmune": {
        "title": "",
        "content": "componentCloneImmune → Bool : Get or set component clone Immune flag. This works together with the cloneImmune member of the OP_Class. When componentCloneImmune is True, everything inside the clone is immune. When componentCloneImmune is False, it uses the OP_Class cloneImmune member to determine if just the component is immune (its parameters etc, but not the component's network inside)."
      },
      "vfs": {
        "title": "",
        "content": "vfs → VFS (Read Only): An intermediate VFS object from which embedded VFSFile objects can be accessed. For more information see Virtual File System."
      },
      "dirty": {
        "title": "",
        "content": "dirty → Bool (Read Only): True if the contents of the component need to be saved."
      },
      "currentChild": {
        "title": "",
        "content": "currentChild → OP (Read Only): The child operator that is currently selected. To make an operator current, use its own OP.current method."
      },
      "selectedChildren": {
        "title": "",
        "content": "selectedChildren → List (Read Only): The list of currently selected children. To change an individual operator's selection state, use its own OP.selected method."
      },
      "cpuCookTime": {
        "title": "",
        "content": "cpuCookTime → float (Read Only): Duration of the last measured cook in CPU time (in milliseconds)."
      },
      "childrenCPUCookTime": {
        "title": "",
        "content": "childrenCPUCookTime → float (Read Only): The total accumulated cook time of all children of this operator during the last frame. Zero if the operator is not a COMP and/or has no children."
      },
      "childrenCPUCookAbsFrame": {
        "title": "",
        "content": "childrenCPUCookAbsFrame → float (Read Only): The absolute frame on which childrenCPUCookTime is based."
      },
      "gpuMemory": {
        "title": "",
        "content": "gpuMemory → int (Read Only): The amount of GPU memory this OP is using, in bytes."
      },
      "pickable": {
        "title": "",
        "content": "pickable → Bool : Get or set pickable flag."
      },
      "utility": {
        "title": "",
        "content": "utility → Bool : Get or set utility flag."
      },
      "isCOMP": {
        "title": "",
        "content": "isCOMP → bool (Read Only): True if the operator is a component."
      },
      "Privacy": {
        "title": "Privacy",
        "content": "[edit]"
      },
      "isPrivate": {
        "title": "",
        "content": "isPrivate → Bool (Read Only): True if the the component contents cannot be directly viewed."
      },
      "isPrivacyActive": {
        "title": "",
        "content": "isPrivacyActive → Bool (Read Only): True if the component is private, and privacy is active. When inactive the contents can be temporarily viewed."
      },
      "isPrivacyLicensed": {
        "title": "",
        "content": "isPrivacyLicensed → Bool (Read Only): True if the component is private and if the required CodeMeter license is present to run it."
      },
      "privacyFirmCode": {
        "title": "",
        "content": "privacyFirmCode → int (Read Only): The CodeMeter firm code needed to use this private component. 0 if this component is not private using a CodeMeter dongle."
      },
      "privacyProductCode": {
        "title": "",
        "content": "privacyProductCode → int (Read Only): The CodeMeter product code needed to use this private component. 0 if this component is not private using a CodeMeter dongle."
      },
      "privacyDeveloperName": {
        "title": "",
        "content": "privacyDeveloperName → string (Read Only): The name of the developer of this private component."
      },
      "privacyDeveloperEmail": {
        "title": "",
        "content": "privacyDeveloperEmail → string (Read Only): The email of the developer of this private component."
      },
      "Connection": {
        "title": "Connection",
        "content": "[edit]"
      },
      "inputCOMPs": {
        "title": "",
        "content": "inputCOMPs → List (Read Only): List of input components to this component through its top connector."
      },
      "inputCOMPConnectors": {
        "title": "",
        "content": "inputCOMPConnectors → List (Read Only): List of input connectors (on the top) associated with this component."
      },
      "outputCOMPs": {
        "title": "",
        "content": "outputCOMPs → List (Read Only): List of output components from this component through its bottom connector."
      },
      "outputCOMPConnectors": {
        "title": "",
        "content": "outputCOMPConnectors → List (Read Only): List of output connectors (on the bottom) associated with this component."
      },
      "Methods_2": {
        "title": "Methods",
        "content": ""
      },
      "create": {
        "title": "",
        "content": "create(opType, name, initialize=True)→ OP: Create a new node of the given type, inside this component. If name is supplied the new node will use that name, or the next numbered name if its already in use.  opType can be a specific type object, example waveCHOP, or it can be a string 'waveCHOP'.  If given an actual instance of a node n, these can be accessed via type(n) and n.OPType respectively.\nAn initialization script associated with the operator is run, unless initialize=False.\nThe new node is returned.\n\nopType - The python OP type for the type of operator you want to create.\nname - (Optional) The name for the new operator. If there already is an operator with that name, the next numbered name will be used.\ninitialize - (Keyword, Optional) If set to false, then the initialization script for that node won't be run. Most nodes don't do anything to initialize, but some do. For example the Light COMP initializes a network inside itself of SOPs.n.create(waveCHOP)\nw = n.create(boxSOP, 'box12')"
      },
      "collapseSelected": {
        "title": "",
        "content": "collapseSelected()→ None: Move all selected operators into a new Base COMP. Equivalent to right-click on the network background and choosing Collapse Selected."
      },
      "copy": {
        "title": "",
        "content": "copy(OP, name=None, includeDocked=True)→ OP: Copy the operator into this component. If name is supplied, the new node will use that name. The new node is returned.\nOP - The operator to copy. This is not a string, it must be an OP.\nname - (Keyword, Optional) If provided, the new node will have this name. If there already is an operator with that name, the next numbered name will be used.\nincludeDocked - (Keyword, Optional) When true a copy will include any externally docked operators to the source component.w = n.copy( op('wave1') )"
      },
      "copyOPs": {
        "title": "",
        "content": "copyOPs(listOfOPs)→ List: Copy a list of operators into this component.\nThis is preferred over multiple single copies, as connections between the operators are preserved.\nA new list with the created operators is returned.\n\nlistOfOPs - A list containing one or more OPs to be copied.alist = [op('wave1'), op('wave2')]\nn.copyOPs(alist)"
      },
      "findChildren": {
        "title": "",
        "content": "findChildren(type=None, name=None, path=None, depth=None, maxDepth=None, text=None, comment=None, tags=[], allTags=False, parValue=None, parExpr=None, parName=None, onlyNonDefaults=False, includeUtility=False, key=None)→ List of OPs: Return a list of operators matching the specified criteria.\ntype - (Keyword, Optional) Specify the type of OP.  Example type=boxSOP\nname - (Keyword, Optional) Specify the name of the OP. Pattern Matching supported. Example: name='project*'\npath - (Keyword, Optional) Specify the path of the OP. Pattern Matching supported. Example: path='*/pics/*'\ndepth - (Keyword, Optional) Specify the relative depth of the OP to the calling OP.  Children have depth 1, their children have depth 2, etc.\nmaxDepth - (Keyword, Optional) Specify the maximum relative depth of the OP from the calling OP.\ntext - (Keyword, Optional) Specify the DAT contents of the OP.  Pattern Matching supported.  Example: text='*import*'\ncomment - (Keyword, Optional) Specify the OP comment.  Pattern Matching supported.  Example: comment='*todo*'\ntags - (Keyword, Optional) Specify a list of tags to search. Pattern Matching supported.  Example: tags=['*sequencer*', '*interface*']\nallTags - (Keyword, Optional) When True, only include OPs where all specified tags are matched.\nparValue - (Keyword, Optional) Specify the value of any parameters in the OP.  Pattern Matching supported.  Example: parValue='500'\nparExpr - (Keyword, Optional) Specify the expression of any parameters in the OP.  Pattern Matching supported.  Example: parExpr='*sin*'\nparName - (Keyword, Optional) Specify the name of any parameters in the OP.  Pattern Matching supported.  Example: parName='clone'\nonlyNonDefaults - (Keyword, Optional) When True, only non default parameters are included.\nincludeUtility - (Keyword, Optional) If specified, controls whether or not Utility nodes (e.g. Comments) are included in the results.\nkey - (Keyword, Optional) Specify a custom search function.#find all OPs whose name begins with circle\nn.findChildren(name='circle*')\n\n#find all wide CHOPs\nn.findChildren(type=CHOP, key = lambda x: x.nodeWidth > 200)\n\n#find all COMPs specifying clones\nn.findChildren(type=COMP, parName='clone', onlyNonDefaults=True)"
      },
      "initializeExtensions": {
        "title": "",
        "content": "initializeExtensions(index=None)→ Extension: Initialize the components extensions. To initialize an individual extension, specify its index.\nReturns the compiled extension.\n\nindex - (Optional) Index to initialize. 0 = first extension, etc.n.initializeExtensions(0) # initialize first extension."
      },
      "loadTox": {
        "title": "",
        "content": "loadTox(filepath, unwired=False, pattern=None, password=None)→ OP: Load the component from the given file path into this component.\nfilepath - The path and filename of the .tox to load.\nunwired - (Keyword, Optional) If True, the component inputs will remain unwired.\npattern - (Keyword, Optional) Can be specified to only load operators within the component that match the pattern. Wildcards are not supported.\npassword - (Keyword, Optional) If specified, decrypts the tox with the password."
      },
      "loadByteArray": {
        "title": "",
        "content": "loadByteArray(byteArray, unwired=False, pattern=None, password=None)→ OP: Load the component from the given bytearray into this COMP. See .saveByteArray() as a way to generate this byteArray.\nbytearray - A bytearray containing the component, from a call to saveByteArray().\nunwired - (Keyword, Optional) If True, the component inputs will remain unwired.\npattern - (Keyword, Optional) Can be specified to only load operators within the component that match the pattern. Wildcards are not supported.\npassword - (Keyword, Optional) If specified, decrypts the component with the password.\""
      },
      "reload": {
        "title": "",
        "content": "reload(filepath, password=None)→ None: Reloads the component from the given file path. This will replace its children as well as top level parameters and update flags, node width/height, storage, comments and inputs (but keep original node x,y).\nfilepath - The path and filename of the .tox to load.\npassword - (Keyword, Optional) If specified, decrypts the component with the password.\""
      },
      "resetNetworkView": {
        "title": "",
        "content": "resetNetworkView(recurse)→ None: Reset the network view such that the network editor will be re-homed upon entering this component.\nrecurse - (Optional) When True, resets network view of all children components as well. Default False.n.resetNetworkView(True) # reset network view of n and all its children."
      },
      "save": {
        "title": "",
        "content": "save(filepath, createFolders=False, password=None)→ Path: Saves the component to disk. If no path is provided, a default filename is used and the .tox is saved to project.folder.\nReturns the filename used.\n\nfilepath - (Optional) The path and filename to save the .tox to.\ncreateFolders - (Keyword, Optional) If True, it creates the not existent directories provided by the filepath.\npassword - (Keyword, Optional) If specified, encrypts the tox with the password.name = n.save() # save in native tox format with default name\nn.save('output.tox')  # supply name\nn.save('C:/Desktop/myFolder/output.tox', createFolders=True)  # supply name and createFolder flag"
      },
      "saveByteArray": {
        "title": "",
        "content": "saveByteArray(password=None)→ bytearray: Save the component into a bytearray. The bytearray is the same data that is held in a .tox file. loadByteArray() can be used to load the component.\npassword - (Keyword, Optional) If specified, encrypts the tox with the password."
      },
      "saveExternalTox": {
        "title": "",
        "content": "saveExternalTox(recurse=False, password=None)→ int: Save out the contents of any COMP referencing an external .tox\nReturns the number of components saved.\n\nrecurse - (Keyword, Optional) If set to True, child components are included in the operation.\npassword - (Keyword, Optional) If specified, encrypts the tox with the password.root.saveExternalTox(recurse=True)\nop('geo1').saveExternalTox(recurse=False)"
      },
      "Custom_Parameters": {
        "title": "Custom Parameters",
        "content": "[edit]"
      },
      "appendCustomPage": {
        "title": "",
        "content": "appendCustomPage(name)→ Page: Add a new page of custom parameters. See Page Class for more details. See Custom Parameters for the procedure.\nn = op('base1')\npage = n.appendCustomPage('Custom1')\npage.appendFloat('X1')"
      },
      "destroyCustomPars": {
        "title": "",
        "content": "destroyCustomPars()→ Total: Remove all custom parameters from COMP."
      },
      "sortCustomPages": {
        "title": "",
        "content": "sortCustomPages(page1, page2, page3...)→ None: Reorder custom parameter pages by listing their page names.\nn = op('base1')\nn.sortCustomPages('Definition','Controls')"
      },
      "Privacy_2": {
        "title": "Privacy",
        "content": "[edit]"
      },
      "accessPrivateContents": {
        "title": "",
        "content": "accessPrivateContents(key)→ Bool: Gain access to a private component.  The component will still be private the next time it is saved or re-opened.\nReturns true when the key is correct, and access is granted. If dongle privacy is being used, no arguments are required.\n\nkey - (Optional) The existing key phrase. This should resolve to a non-blank string. Not required for dongle privacy.n.accessPrivateContents('secret')"
      },
      "addPrivacy": {
        "title": "",
        "content": "addPrivacy(firmCode, productCode, developerName=None, developerEmail=None)→ None: Add privacy to a component with the given CodeMeter firm code and product code.\nPrivacy can only be added to components that currently have no privacy. Adding Privacy requires a Pro license.\nThe first bit of the CodeMeter Dongle's Feature Map must be set to enable privacy and add prodcut code as well as to access the private component in edit mode later.\nThe private component can be used with any Dongle matching the firm code and product code without the first Feature Map bit set. In this case the component will run in private mode keeping the contents of the component hidden.\n\nfirmCode - The CodeMeter firm code to use.\nproductCode - The CodeMeter product code to use.n.addPrivacy(10, 4)"
      },
      "blockPrivateContents": {
        "title": "",
        "content": "blockPrivateContents(key)→ None: Block access to a private component that was temporarily accessible.\nn.blockPrivateContents()"
      },
      "removePrivacy": {
        "title": "",
        "content": "removePrivacy(key)→ Bool: Completely remove privacy from a component.\nReturns true when the key is correct.\n\nkey - The existing key phrase. This should resolve to a non-blank string.n.removePrivacy('secret')"
      },
      "Component_Variables": {
        "title": "Component Variables",
        "content": "[edit]"
      },
      "setVar": {
        "title": "",
        "content": "setVar(name, value)→ None: Set a component variable to the specified value.\nname - The variable name to use.\nvalue - The value for this variable."
      },
      "unsetVar": {
        "title": "",
        "content": "unsetVar(name)→ None: Unset the specified component variable. This removes the entry from the 'local/set_variables' table, if found.\nname - The name of the variable to unset."
      },
      "vars": {
        "title": "",
        "content": "vars(pattern1, pattern2...)→ List: Return a list of all component variables in this COMP. Optional name patterns may be specified.\npattern -  (Optional) The name(s) of variables whose values should be returned. Pattern Matching can be used.a = n.vars()\na = n.vars('A*', 'B*')"
      },
      "OP_Class": {
        "title": "OP Class",
        "content": "[edit]"
      },
      "Members_3": {
        "title": "Members",
        "content": ""
      },
      "General": {
        "title": "General",
        "content": "[edit]"
      },
      "valid": {
        "title": "",
        "content": "valid → bool (Read Only): True if the referenced operator currently exists, False if it has been deleted."
      },
      "id": {
        "title": "",
        "content": "id → int (Read Only): Unique id for the operator. This id can also be passed to the op() and ops() methods. Id's are not consistent when a file is re-opened, and will change if the OP is copied/pasted, changes OP types, deleted/undone. The id will not change if the OP is renamed though. Its data type is integer."
      },
      "name": {
        "title": "",
        "content": "name → str : Get or set the operator name."
      },
      "path": {
        "title": "",
        "content": "path → str (Read Only): Full path to the operator."
      },
      "digits": {
        "title": "",
        "content": "digits → int (Read Only): Returns the numeric value of the last consecutive group of digits in the name, or None if not found. The digits can be in the middle of the name if there are none at the end of the name."
      },
      "base": {
        "title": "",
        "content": "base → str (Read Only): Returns the beginning portion of the name occurring before any digits."
      },
      "passive": {
        "title": "",
        "content": "passive → bool (Read Only): If true, operator will not cook before its access methods are called.  To use a passive version of an operator n, use passive(n)."
      },
      "curPar": {
        "title": "",
        "content": "curPar → td.Par (Read Only): The parameter currently being evaluated. Can be used in a parameter expression to reference itself. An easy way to see this is to put the expression curPar.name in any string parameter."
      },
      "curBlock": {
        "title": "",
        "content": "curBlock →  (Read Only): The SequenceBlock of the parameter currently being evaluated. Can be used in a parameter expression to reference itself."
      },
      "curSeq": {
        "title": "",
        "content": "curSeq → Sequence (Read Only): The Sequence of the parameter currently being evaluated. Can be used in a parameter expression to reference itself."
      },
      "time": {
        "title": "",
        "content": "time → OP (Read Only): Time Component that defines the operator's time reference."
      },
      "ext": {
        "title": "",
        "content": "ext → class (Read Only): The object to search for parent extensions.\nme.ext.MyClass"
      },
      "fileFolder": {
        "title": "",
        "content": "fileFolder → str (Read Only): Returns the folder where this node is saved."
      },
      "filePath": {
        "title": "",
        "content": "filePath → str (Read Only): Returns the file location of this node."
      },
      "mod": {
        "title": "",
        "content": "mod → mod (Read Only): Get a module on demand object that searches for DAT modules relative to this operator."
      },
      "pages": {
        "title": "",
        "content": "pages → list (Read Only): A list of all built-in pages."
      },
      "parGroup": {
        "title": "",
        "content": "parGroup → tuple (Read Only): An intermediate parameter collection object, from which a specific parameter group can be found.\nn.parGroup.t\n# or\nn.parGroup['t']"
      },
      "par": {
        "title": "",
        "content": "par → td.Par (Read Only): An intermediate parameter collection object, from which a specific parameter can be found.\nn.par.tx\n# or\nn.par['tx']"
      },
      "builtinPars": {
        "title": "",
        "content": "builtinPars → list or par (Read Only): A list of all built-in parameters."
      },
      "customParGroups": {
        "title": "",
        "content": "customParGroups → list of parGroups (Read Only): A list of all ParGroups, where a ParGroup is a set of parameters all drawn on the same line of a dialog, sharing the same label."
      },
      "customPars": {
        "title": "",
        "content": "customPars → list of par (Read Only): A list of all custom parameters."
      },
      "customPages": {
        "title": "",
        "content": "customPages → list (Read Only): A list of all custom pages."
      },
      "replicator": {
        "title": "",
        "content": "replicator → OP or None (Read Only): The replicatorCOMP that created this operator, if any."
      },
      "storage": {
        "title": "",
        "content": "storage → dict (Read Only): Storage is dictionary associated with this operator. Values stored in this dictionary are persistent, and saved with the operator. The dictionary attribute is read only, but not its contents. Its contents may be manipulated directly with methods such as OP.fetch() or OP.store() described below, or examined with an Examine DAT."
      },
      "tags": {
        "title": "",
        "content": "tags → list : Get or set a set of user defined strings. Tags can be searched using OP.findChildren() and the OP Find DAT.\nThe set is a regular python set, and can be accessed accordingly:\n\nn.tags = ['effect', 'image filter']\nn.tags.add('darken')"
      },
      "children": {
        "title": "",
        "content": "children → list (Read Only): A list of operators contained within this operator. Only component operators have children, otherwise an empty list is returned."
      },
      "numChildren": {
        "title": "",
        "content": "numChildren → int (Read Only): Returns the number of children contained within the operator. Only component operators have children."
      },
      "numChildrenRecursive": {
        "title": "",
        "content": "numChildrenRecursive → int (Read Only): Returns the number of operators contained recursively within this operator. Only component operators have children."
      },
      "op": {
        "title": "",
        "content": "op → OP or None (Read Only): The operator finder object, for accessing operators through paths or shortcuts. Note: a version of this method that searches relative to '/' is also in the global td module.\nop(pattern1, pattern2..., includeUtility=False) → OP or None\n\n\nReturns the first OP whose path matches the given pattern, relative to the inside of this operator. Will return None if nothing is found. Multiple patterns may be specified which are all added to the search. Numeric OP ids may also be used.\n\npattern - Can be string following the Pattern Matching rules, specifying which OP to return, or an integer, which must be an OP Id. Multiple patterns can be given, the first matching OP will be returned.\nincludeUtility (Optional) - if True, allow Utility nodes to be returned. If False, Utility nodes will be ignored.b = op('project1')\nb = op('foot*', 'hand*') #comma separated\nb = op('foot* hand*')  #space separated\nb = op(154)\n\n\nop.shortcut → OP\n\n\nAn operator specified with by a Global OP Shortcut. If no operator exists an exception is raised. These shortcuts are global, and must be unique. That is, cutting and pasting an operator with a Global OP Shortcut specified will lead to a name conflict. One shortcut must be renamed in that case. Furthermore, only components can be given Global OP Shortcuts.\nshortcut - Corresponds to the Global OP Shortcut parameter specified in the target operator.b = op.Videoplayer\n\nTo list all Global OP Shortcuts:\n\nfor x in op:\n\tprint(x)"
      },
      "opex": {
        "title": "",
        "content": "opex → OP (Read Only): An operator finder object, for accessing operators through paths or shortcuts. Works like the op() shortcut method, except it will raise an exception if it fails to find the node instead of returning None as op() does. This is now the recommended way to get nodes in parameter expressions, as the error will be more useful than, for example, NoneType has no attribute \"par\", that is often seen when using op(). Note: a version of this method that searches relative to '/' is also in the global td module.\n    op(pattern1, pattern2..., includeUtility=False) → OP\n\n\nReturns the first OP whose path matches the given pattern, relative to the inside of this operator. Will return None if nothing is found. Multiple patterns may be specified which are all added to the search. Numeric OP ids may also be used.\n\npattern - Can be string following the Pattern Matching rules, specifying which OP to return, or an integer, which must be an OP Id. Multiple patterns can be given, the first matching OP will be returned.\nincludeUtility (Optional) - if True, allow Utility nodes to be returned. If False, Utility operators will be ignored."
      },
      "parent": {
        "title": "",
        "content": "parent → Shortcut (Read Only): The Parent Shortcut object, for accessing parent components through indices or shortcuts.\nNote: a version of this method that searches relative to the current operator is also in the global td module.\nparent(n) → OP or None\n\n\nThe nth parent of this operator. If n not specified, returns the parent. If n = 2, returns the parent of the parent, etc. If no parent exists at that level, None is returned.\n\nn - (Optional) n is the number of levels up to climb. When n = 1 it will return the operator's parent.p = parent(2) #grandfather\n\n\nparent.shortcut → OP\n\n\nA parent component specified with a shortcut. If no parent exists an exception is raised.\n\nshortcut - Corresponds to the Parent Shortcut parameter specified in the target parent.n = parent.Videoplayer\n\nSee also Parent Shortcut for more examples."
      },
      "iop": {
        "title": "",
        "content": "iop → OP (Read Only): The Internal Operator Shortcut object, for accessing internal shortcuts. See also Internal Operators.\nNote: a version of this method that searches relative to the current operator is also in the global td Module."
      },
      "ipar": {
        "title": "",
        "content": "ipar → ParCollection (Read Only): The Internal Operator Parameter Shortcut object, for accessing internal shortcuts.  See also Internal Parameters.\nNote: a version of this method that searches relative to the current operator is also in the global td Module."
      },
      "currentPage": {
        "title": "",
        "content": "currentPage → Page : Get or set the currently displayed parameter page. It can be set by setting it to another page or a string label.\nn.currentPage = 'Common'"
      },
      "Common_Flags": {
        "title": "Common Flags",
        "content": "[edit] The following methods get or set specific operator Flags. Note specific operators may contain other flags not in this section."
      },
      "activeViewer": {
        "title": "",
        "content": "activeViewer → bool : Get or set Viewer Active Flag."
      },
      "allowCooking": {
        "title": "",
        "content": "allowCooking → bool : Get or set Cooking Flag. Only COMPs can disable this flag."
      },
      "bypass": {
        "title": "",
        "content": "bypass → bool : Get or set Bypass Flag."
      },
      "cloneImmune": {
        "title": "",
        "content": "cloneImmune → bool : Get or set Clone Immune Flag."
      },
      "current": {
        "title": "",
        "content": "current → bool : Get or set Current Flag."
      },
      "display": {
        "title": "",
        "content": "display → bool : Get or set Display Flag."
      },
      "expose": {
        "title": "",
        "content": "expose → bool : Get or set the Expose Flag which hides a node from view in a network."
      },
      "lock": {
        "title": "",
        "content": "lock → bool : Get or set Lock Flag."
      },
      "selected": {
        "title": "",
        "content": "selected → bool : Get or set Selected Flag. This controls if the node is part of the network selection. (yellow box around it)."
      },
      "seq": {
        "title": "",
        "content": "seq →  (Read Only): An intermediate sequence collection object, from which a specific sequence group can be found.\nn.seq.Color #raises Exception if not found.\n# or\nn.seq['Color'] #returns None if not found."
      },
      "python": {
        "title": "",
        "content": "python → bool : Get or set parameter expression language as python."
      },
      "render": {
        "title": "",
        "content": "render → bool : Get or set Render Flag."
      },
      "showCustomOnly": {
        "title": "",
        "content": "showCustomOnly → bool : Get or set the Show Custom Only Flag which controls whether or not non custom parameters are display in parameter dialogs."
      },
      "showDocked": {
        "title": "",
        "content": "showDocked → bool : Get or set Show Docked Flag. This controls whether this node is visible or hidden when it is docked to another node."
      },
      "viewer": {
        "title": "",
        "content": "viewer → bool : Get or set Viewer Flag."
      },
      "Appearance": {
        "title": "Appearance",
        "content": "[edit]"
      },
      "color": {
        "title": "",
        "content": "color → tuple(r, g, b) : Get or set color value, expressed as a 3-tuple, representing its red, green, blue values. To convert between color spaces, use the built in colorsys module."
      },
      "comment": {
        "title": "",
        "content": "comment → str : Get or set comment string."
      },
      "nodeHeight": {
        "title": "",
        "content": "nodeHeight → int : Get or set node height, expressed in network editor units."
      },
      "nodeWidth": {
        "title": "",
        "content": "nodeWidth → int : Get or set node width, expressed in network editor units."
      },
      "nodeX": {
        "title": "",
        "content": "nodeX → int : Get or set node X value, expressed in network editor units, measured from its left edge."
      },
      "nodeY": {
        "title": "",
        "content": "nodeY → int : Get or set node Y value, expressed in network editor units, measured from its bottom edge."
      },
      "nodeCenterX": {
        "title": "",
        "content": "nodeCenterX → int : Get or set node X value, expressed in network editor units, measured from its center."
      },
      "nodeCenterY": {
        "title": "",
        "content": "nodeCenterY → int : Get or set node Y value, expressed in network editor units, measured from its center."
      },
      "dock": {
        "title": "",
        "content": "dock → OP : Get or set the operator this operator is docked to.  To clear docking, set this member to None."
      },
      "docked": {
        "title": "",
        "content": "docked → list (Read Only): The (possibly empty) list of operators docked to this node."
      },
      "Connection_2": {
        "title": "Connection",
        "content": "[edit] See also the OP.parent methods.  To connect components together see COMP_Class#Connection section."
      },
      "inputs": {
        "title": "",
        "content": "inputs → list (Read Only): List of input operators (via left side connectors) to this operator. To get the number of inputs, use len(OP.inputs)."
      },
      "outputs": {
        "title": "",
        "content": "outputs → list (Read Only): List of output operators (via right side connectors) from this operator."
      },
      "inputConnectors": {
        "title": "",
        "content": "inputConnectors → list (Read Only): List of input connectors (on the left side) associated with this operator."
      },
      "outputConnectors": {
        "title": "",
        "content": "outputConnectors → list (Read Only): List of output connectors (on the right side) associated with this operator."
      },
      "Cook_Information": {
        "title": "Cook Information",
        "content": "[edit]"
      },
      "cookFrame": {
        "title": "",
        "content": "cookFrame → float (Read Only): Last frame at which this operator cooked."
      },
      "cookTime": {
        "title": "",
        "content": "cookTime → float (Read Only): Deprecated Duration of the last measured cook (in milliseconds)."
      },
      "cookAbsFrame": {
        "title": "",
        "content": "cookAbsFrame → float (Read Only): Last absolute frame at which this operator cooked."
      },
      "cookStartTime": {
        "title": "",
        "content": "cookStartTime → float (Read Only): Last offset from frame start at which this operator cook began, expressed in milliseconds."
      },
      "cookEndTime": {
        "title": "",
        "content": "cookEndTime → float (Read Only): Last offset from frame start at which this operator cook ended, expressed in milliseconds.  Other operators may have cooked between the start and end time.  See the cookTime member for this operator's specific cook duration."
      },
      "cookedThisFrame": {
        "title": "",
        "content": "cookedThisFrame → bool (Read Only): True when this operator has cooked this frame."
      },
      "cookedPreviousFrame": {
        "title": "",
        "content": "cookedPreviousFrame → bool (Read Only): True when this operator has cooked the previous frame."
      },
      "childrenCookTime": {
        "title": "",
        "content": "childrenCookTime → float (Read Only): Deprecated The total accumulated cook time of all children of this operator during the last frame. Zero if the operator is not a COMP and/or has no children."
      },
      "childrenCookAbsFrame": {
        "title": "",
        "content": "childrenCookAbsFrame → float (Read Only): Deprecated The absolute frame on which childrenCookTime is based."
      },
      "gpuCookTime": {
        "title": "",
        "content": "gpuCookTime → float (Read Only): Duration of GPU operations during the last measured cook (in milliseconds)."
      },
      "childrenGPUCookTime": {
        "title": "",
        "content": "childrenGPUCookTime → float (Read Only): The total accumulated GPU cook time of all children of this operator during the last frame. Zero if the operator is not a COMP and/or has no children."
      },
      "childrenGPUCookAbsFrame": {
        "title": "",
        "content": "childrenGPUCookAbsFrame → float (Read Only): The absolute frame on which childrenGPUCookTime is based."
      },
      "totalCooks": {
        "title": "",
        "content": "totalCooks → int (Read Only): Number of times the operator has cooked."
      },
      "cpuMemory": {
        "title": "",
        "content": "cpuMemory → int (Read Only): The approximate amount of CPU memory this Operator is using, in bytes."
      },
      "Type": {
        "title": "Type",
        "content": "[edit]"
      },
      "type": {
        "title": "",
        "content": "type → str (Read Only): Operator type as a string. Example: 'oscin'."
      },
      "subType": {
        "title": "",
        "content": "subType → str (Read Only): Operator subtype. Currently only implemented for components. May be one of: 'panel', 'object', or empty string in the case of base components."
      },
      "OPType": {
        "title": "",
        "content": "OPType → str (Read Only): Python operator class type, as a string. Example: 'oscinCHOP'. Can be used with COMP.create() method."
      },
      "label": {
        "title": "",
        "content": "label → str (Read Only): Operator type label. Example: 'OSC In'."
      },
      "icon": {
        "title": "",
        "content": "icon → str (Read Only): Get the letters used to create the operator's icon."
      },
      "family": {
        "title": "",
        "content": "family → str (Read Only): Operator family. Example: CHOP. Use the global dictionary families for a list of each operator type."
      },
      "isFilter": {
        "title": "",
        "content": "isFilter → bool (Read Only): True if operator is a filter, false if it is a generator."
      },
      "minInputs": {
        "title": "",
        "content": "minInputs → int (Read Only): Minimum number of inputs to the operator."
      },
      "maxInputs": {
        "title": "",
        "content": "maxInputs → int (Read Only): Maximum number of inputs to the operator."
      },
      "isMultiInputs": {
        "title": "",
        "content": "isMultiInputs → bool (Read Only): True if inputs are ordered, false otherwise. Operators with an arbitrary number of inputs have unordered inputs, example Merge CHOP."
      },
      "visibleLevel": {
        "title": "",
        "content": "visibleLevel → int (Read Only): Visibility level of the operator. For example, expert operators have visibility level 1, regular operators have visibility level 0."
      },
      "isBase": {
        "title": "",
        "content": "isBase → bool (Read Only): True if the operator is a Base (miscellaneous) component."
      },
      "isCHOP": {
        "title": "",
        "content": "isCHOP → bool (Read Only): True if the operator is a CHOP."
      },
      "isDAT": {
        "title": "",
        "content": "isDAT → bool (Read Only): True if the operator is a DAT."
      },
      "isMAT": {
        "title": "",
        "content": "isMAT → bool (Read Only): True if the operator is a Material."
      },
      "isObject": {
        "title": "",
        "content": "isObject → bool (Read Only): True if the operator is an object."
      },
      "isPanel": {
        "title": "",
        "content": "isPanel → bool (Read Only): True if the operator is a Panel."
      },
      "isSOP": {
        "title": "",
        "content": "isSOP → bool (Read Only): True if the operator is a SOP."
      },
      "isTOP": {
        "title": "",
        "content": "isTOP → bool (Read Only): True if the operators is a TOP."
      },
      "licenseType": {
        "title": "",
        "content": "licenseType → str (Read Only): Type of License required for the operator."
      },
      "Methods_3": {
        "title": "Methods",
        "content": ""
      },
      "General_2": {
        "title": "General",
        "content": "[edit] NOTE: create(), copy() and copyOPs() is done by the parent operator (a component).  For more information see COMP.create, COMP.copy and COMP.copyOPs methods."
      },
      "pars": {
        "title": "",
        "content": "pars(pattern)→ list: Returns a (possibly empty) list of parameter objects that match the pattern.\npattern - Is a string following the Pattern Matching rules, specifying which parameters to return.newlist = op('geo1').pars('t?', 'r?', 's?') #translate/rotate/scale parameters\nNote: If searching for a single parameter given a name, it's much more efficient to use the subscript operator. For example:name = 'MyName1'\nop('geo1').par[name]"
      },
      "cook": {
        "title": "",
        "content": "cook(force=False, recurse=False, includeUtility=False)→ None: Cook the contents of the operator if required.\nforce - (Keyword, Optional) If True, the operator will always cook, even if it wouldn't under normal circumstances.\nrecurse - (Keyword, Optional) If True, all children and sub-children of the operator will be cooked.\nincludeUtility - (Keyword, Optional) If specified, controls whether or not utility components (eg Comments) are included in the results."
      },
      "copyParameters": {
        "title": "",
        "content": "copyParameters(OP, custom=True, builtin=True)→ None: Copy all of the parameters from the specified operator.  Both operators should be the same type.\nOP - The operator to copy.\ncustom - (Keyword, Optional) When True, custom parameters will be copied.\nbuiltin - (Keyword, Optional) When True, built in parameters will be copied.op('geo1').copyParameters( op('geo2') )"
      },
      "changeType": {
        "title": "",
        "content": "changeType(OPtype)→ OP: Change referenced operator to a new operator type.  After this call, this OP object should no longer be referenced.  Instead use the returned OP object.\nOPtype - The python class name of the operator type you want to change this operator to. This is not a string, but instead is a class defined in the global td module.n = op('wave1').changeType(nullCHOP) #changes 'wave1' into a Null CHOP\nn = op('text1').changeType(tcpipDAT) #changes 'text1' operator into a TCPIP DAT"
      },
      "dependenciesTo": {
        "title": "",
        "content": "dependenciesTo(OP)→ list: Returns a (possibly empty) list of operator dependency paths between this operator and the specified operator. Multiple paths may be found."
      },
      "evalExpression": {
        "title": "",
        "content": "evalExpression(str)→ value: Evaluate the expression from the context of this OP.  Can be used to evaluate arbitrary snippets of code from arbitrary locations. \nstr - The expression to evaluate.op('wave1').evalExpression('me.digits')  #returns 1\n\nIf the expression already resides in a parameter, use that parameters evalExpression() method instead."
      },
      "destroy": {
        "title": "",
        "content": "destroy()→ None: Destroy the operator referenced by this OP. An exception will be raised if the OP's operator has already been destroyed."
      },
      "var": {
        "title": "",
        "content": "var(name, search=True)→ str: Evaluate a variable. This will return the empty string, if not found. Most information obtained from variables (except for Root and Component variables) are accessible through other means in Python, usually in the global td module.\nname - The variable name to search for.\nsearch - (Keyword, Optional) If set to True (which is default) the operator hierarchy is searched until a variable matching that name is found.  If false, the search is constrained to the operator."
      },
      "openMenu": {
        "title": "",
        "content": "openMenu(x=None, y=None)→ None: Open a node menu for the operator at x, y.  Opens at mouse if x & y are not specified.\nx - (Keyword, Optional) The X coordinate of the menu, measured in screen pixels.\ny - (Keyword, Optional) The Y coordinate of the menu, measured in screen pixels."
      },
      "relativePath": {
        "title": "",
        "content": "relativePath(OP)→ str: Returns the relative path from this operator to the OP that is passed as the argument.   See OP.shortcutPath for a version using expressions."
      },
      "setInputs": {
        "title": "",
        "content": "setInputs(listOfOPs)→ None: Set all the operator inputs to the specified list.\nlistOfOPs - A list containing one or more OPs. Entries in the list can be None to disconnect specific inputs.  An empty list disconnects all inputs."
      },
      "shortcutPath": {
        "title": "",
        "content": "shortcutPath(OP, toParName=None)→ str: Returns an expression from this operator to the OP that is passed as the argument. See OP.relativePath for a version using relative path constants.\ntoParName - (Keyword, Optional) Return an expression to this parameter instead of its operator."
      },
      "ops": {
        "title": "",
        "content": "ops(pattern1, pattern2.., includeUtility=False)→ list of OPs: Returns a (possibly empty) list of OPs that match the patterns, relative to the inside of this OP.\nMultiple patterns may be provided. Numeric OP ids may also be used.\n\npattern - Can be string following the Pattern Matching rules, specifying which OPs to return, or an integer, which must be an OP Id. Multiple patterns can be given and all matched OPs will be returned.\nincludeUtility - (Keyword, Optional) If specified, controls whether or not utility components (eg Comments) are included in the results.Note: a version of this method that searches relative to '/' is also in the global td module.\n\nnewlist = n.ops('arm*', 'leg*', 'leg5/foot*')"
      },
      "resetPars": {
        "title": "",
        "content": "resetPars(parNames='*', parGroupNames='*', pageNames='*', includeBuiltin=True, includeCustom=True)→ bool: Resets the specified parameters in the operator.\nReturns true if anything was changed.\n\nparNames (Keyword, Optional) - Specify parameters by Par name.\nparGroupNames (Keyword, Optional) - Specify parameters by ParGroup name.\npageNames (Keyword, Optional) - Specify parameters by page name.\nincludeBuiltin (Keyword, Optional) - Include builtin parameters.\nincludeCustom (Keyword, Optional) - Include custom parameters.op('player').resetPars(includeBuiltin=False) # only reset custom"
      },
      "Errors": {
        "title": "Errors",
        "content": "[edit]"
      },
      "addScriptError": {
        "title": "",
        "content": "addScriptError(msg)→ None: Adds a script error to a node.\nmsg - The error to add."
      },
      "addError": {
        "title": "",
        "content": "addError(msg)→ None: Adds an error to an operator.  Only valid if added while the operator is cooking. (Example Script SOP, CHOP, DAT).\nmsg - The error to add."
      },
      "addWarning": {
        "title": "",
        "content": "addWarning(msg)→ None: Adds a warning to an operator.  Only valid if added while the operator is cooking. (Example Script SOP, CHOP, DAT).\nmsg - The error to add."
      },
      "errors": {
        "title": "",
        "content": "errors(recurse=False)→ str: Get error messages associated with this OP.\nrecurse - Get errors in any children or subchildren as well."
      },
      "warnings": {
        "title": "",
        "content": "warnings(recurse=False)→ str: Get warning messages associated with this OP.\nrecurse - Get warnings in any children or subchildren as well."
      },
      "scriptErrors": {
        "title": "",
        "content": "scriptErrors(recurse=False)→ str: Get script error messages associated with this OP.\nrecurse - Get errors in any children or subchildren as well."
      },
      "clearScriptErrors": {
        "title": "",
        "content": "clearScriptErrors(recurse=False, error='*')→ None: Clear any errors generated during script execution.  These may be generated during execution of DATs, Script Nodes, Replicator COMP callbacks, etc.\nrecurse - Clear script errors in any children or subchildren as well.\nerror - Pattern to match when clearing errorsop('/project1').clearScriptErrors(recurse=True)"
      },
      "childrenCPUMemory": {
        "title": "",
        "content": "childrenCPUMemory()→ int: Returns the total CPU memory usage for all the children from this COMP."
      },
      "childrenGPUMemory": {
        "title": "",
        "content": "childrenGPUMemory()→ int: Returns the total GPU memory usage for all the children from this COMP."
      },
      "Appearance_2": {
        "title": "Appearance",
        "content": "[edit]"
      },
      "resetNodeSize": {
        "title": "",
        "content": "resetNodeSize()→ None: Reset the node tile size to its default width and height."
      },
      "Viewers": {
        "title": "Viewers",
        "content": "[edit]"
      },
      "closeViewer": {
        "title": "",
        "content": "closeViewer(topMost=False)→ None: Close the floating content viewers of the OP.\ntopMost - (Keyword, Optional) If True, any viewer window containing any parent of this OP is closed instead.op('wave1').closeViewer()\nop('wave1').closeViewer(topMost=True) # any viewer that contains 'wave1' will be closed."
      },
      "openViewer": {
        "title": "",
        "content": "openViewer(unique=False, borders=True)→ None: Open a floating content viewer for the OP.\nunique - (Keyword, Optional) If False, any existing viewer for this OP will be re-used and popped to the foreground. If unique is True, a new window is created each time instead.\nborders - (Keyword, Optional) If true, the floating window containing the viewer will have borders.op('geo1').openViewer(unique=True, borders=False) # opens a new borderless viewer window for 'geo1'"
      },
      "resetViewer": {
        "title": "",
        "content": "resetViewer(recurse=False)→ None: Reset the OP content viewer to default view settings.\nrecurse - (Keyword, Optional) If True, this is done for all children and sub-children as well.op('/').resetViewer(recurse=True) # reset the viewer for all operators in the entire file."
      },
      "openParameters": {
        "title": "",
        "content": "openParameters()→ None: Open a floating dialog containing the operator parameters."
      },
      "Storage": {
        "title": "Storage",
        "content": "[edit] Storage can be used to keep data within components. Storage is implemented as one python dictionary per node. When an element of storage is changed by using n.store() as explained below, expressions and operators that depend on it will automatically re-cook.  It is retrieved with the n.fetch() function. Storage is saved in .toe and .tox files and restored on startup. Storage can hold any python object type (not just strings as in Tscript variables).  Storage elements can also have optional startup values, specified separately. Use these startup values for example, to avoid saving and loading some session specific object, and instead save or load a well defined object like None. See the Examine DAT for procedurally viewing the contents of storage."
      },
      "fetch": {
        "title": "",
        "content": "fetch(key, default, search=True, storeDefault=False)→ value: Return an object from the OP storage dictionary.  If the item is not found, and a default it supplied, it will be returned instead.\nkey - The name of the entry to retrieve.\ndefault - (Optional) If provided and no item is found then the passed value/object is returned instead.\nstoreDefault - (Keyword, Optional) If True, and the key is not found, the default is stored as well.\nsearch - (Keyword, Optional) If True, the parent of each OP is searched recursively until a match is foundv = n.fetch('sales5', 0.0)"
      },
      "fetchOwner": {
        "title": "",
        "content": "fetchOwner(key)→ OP: Return the operator which contains the stored key, or None if not found.\nkey - The key to the stored entry you are looking for.who = n.fetchOwner('sales5') #find the OP that has a storage entry called 'sales5'"
      },
      "store": {
        "title": "",
        "content": "store(key, value)→ value: Add the key/value pair to the OP's storage dictionary, or replace it if it already exists.  If this value is not intended to be saved and loaded in the toe file, it can be be given an alternate value for saving and loading, by using the method storeStartupValue described below.\nkey - A string name for the storage entry. Use this name to retrieve the value using fetch().\nvalue - The value/object to store.n.store('sales5', 34.5) # stores a floating point value 34.5.\nn.store('moviebank', op('/project1/movies')) # stores an OP for easy access later on."
      },
      "unstore": {
        "title": "",
        "content": "unstore(keys1, keys2..)→ None: For key, remove it from the OP's storage dictionary. Pattern Matching is supported as well.\nkeys - The name or pattern defining which key/value pairs to remove from the storage dictionary.n.unstore('sales*') # removes all entries from this OPs storage that start with 'sales'"
      },
      "storeStartupValue": {
        "title": "",
        "content": "storeStartupValue(key, value)→ None: Add the key/value pair to the OP's storage startup dictionary.  The storage element will take on this value when the file starts up.\nkey - A string name for the storage startup entry.\nvalue - The startup value/object to store.n.storeStartupValue('sales5', 1) # 'sales5' will have a value of 1 when the file starts up."
      },
      "unstoreStartupValue": {
        "title": "",
        "content": "unstoreStartupValue(keys1, keys2..)→ None: For key, remove it from the OP's storage startup dictionary. Pattern Matching is supported as well.  This does not affect the stored value, just its startup value.\nkeys - The name or pattern defining which key/value pairs to remove from the storage startup dictionary.n.unstoreStartupValue('sales*') # removes all entries from this OPs storage startup that start with 'sales'"
      },
      "Miscellaneous": {
        "title": "Miscellaneous",
        "content": "[edit]"
      },
      "__getstate__": {
        "title": "",
        "content": "__getstate__()→ dict: Returns a dictionary with persistent data about the object suitable for pickling and deep copies."
      },
      "__setstate__": {
        "title": "",
        "content": "__setstate__()→ dict: Reads the dictionary to update persistent details about the object, suitable for unpickling and deep copies. TouchDesigner Build: Latest\\nwikieditorwikieditor2021.100002018.28070before 2018.28070"
      }
    }
  }
}