{
  "className": "Project_Class",
  "url": "https://docs.derivative.ca/Project_Class",
  "content": {
    "title": "Project Class",
    "items": {
      "Members": {
        "title": "Members",
        "content": ""
      },
      "folder": {
        "title": "",
        "content": "folder → str (Read Only): The folder at which the project resides."
      },
      "name": {
        "title": "",
        "content": "name → str (Read Only): The filename under which the project is saved."
      },
      "saveVersion": {
        "title": "",
        "content": "saveVersion → str (Read Only): The App version number when the project was last saved."
      },
      "saveBuild": {
        "title": "",
        "content": "saveBuild → str (Read Only): The App build number when the project was last saved."
      },
      "saveTime": {
        "title": "",
        "content": "saveTime → str (Read Only): The time and date the project was last saved."
      },
      "saveOSName": {
        "title": "",
        "content": "saveOSName → str (Read Only): The App operating system name when the project was last saved."
      },
      "saveOSVersion": {
        "title": "",
        "content": "saveOSVersion → str (Read Only): The App operating system version when the project was last saved."
      },
      "paths": {
        "title": "",
        "content": "paths → dict (Read Only): A dictionary which can be used to define URL-syntax path prefixes, enabling you to move your media to different locations easily. This dictionary is saved and loaded in the .toe file.  Example: Run project.paths['movies'] = 'C:/MyMovies', and reference it with a parameter expression: movies://butterfly.jpg. To manually convert between expanded and collapsed paths, use tdu.collapsePath() and tdu.expandPath, for example tdu.expandPath('movies://butterfly.jpg') expands to C:/MyMovies/butterfly.jpg. If you already have your paths setup, choosing files from file browsers in OPs will create paths using these shortcuts rather than full paths. Additionally, to enable you to have different media locations on different machines, you can put a JSON file in the same folder as your .toe that gets read on startup. This will override any existing locations saved in projects.paths to the new machine specific file paths specified in the .json. Only existing entries in project.paths will be used. If the .json contains path names not specified in project.paths, those will be ignored. It would contain something like { \"project.paths\": { \"movies\": \"M:/MyMovies\" } }. If your .toe file is called MyProject.10.toe, the JSON file must be called MyProject.Settings.json. The idea is that this .json would be unique to machines, and not commited to version control or shared between machines."
      },
      "cookRate": {
        "title": "",
        "content": "cookRate → float : Get or set the maximum number of frames processed each second. In general you should not need to use this. It is preferred to look at the FPS of the root component to know the cooking rate. Individual components may have their own rates, specified by rate.\na = project.cookRate # get the current cook rate \nproject.cookRate = 30 # set the cook rate to 30 FPS\n\nNote: This is displayed and set in the user interface at the bottom-left: the \"FPS\" field."
      },
      "realTime": {
        "title": "",
        "content": "realTime → bool : Get or set the real time cooking state. When True, frames may be skipped in order to maintain the cookRate. When False, all frames are processed sequentially regardless of duration. This is useful to render movies out using the Movie File Out TOP without dropping any frames for example.\na = project.realTime\nproject.realTime = False # turn off real time playback."
      },
      "isPrivate": {
        "title": "",
        "content": "isPrivate → bool (Read Only): True when the project networks cannot be directly viewed."
      },
      "isPrivateKey": {
        "title": "",
        "content": "isPrivateKey → bool (Read Only): True when the private networks are accessible by a pass phrase."
      },
      "cacheParameters": {
        "title": "",
        "content": "cacheParameters → bool : Cache parameter values instead of always evaluating."
      },
      "externalToxModifiedInProject": {
        "title": "",
        "content": "externalToxModifiedInProject → bool (Read Only): Callback for when an external tox has been modified in the current project and there are other instances of the same tox loaded elsewhere in the project."
      },
      "externalToxModifiedOnDisk": {
        "title": "",
        "content": "externalToxModifiedOnDisk → bool (Read Only): Callback for when an external tox file has been modified on disk."
      },
      "windowOnTop": {
        "title": "",
        "content": "windowOnTop → bool : Get or set the window on top state."
      },
      "windowStartMode": {
        "title": "",
        "content": "windowStartMode → WindowStartMode : Get or set the window start mode.\nThe mode is one of: WindowStartMode.AUTO, WindowStartMode.FULL, WindowStartMode.LEFT, WindowStartMode.RIGHT or WindowStartMode.CUSTOM."
      },
      "windowDraw": {
        "title": "",
        "content": "windowDraw → bool : Get or set the window drawing state."
      },
      "windowStartCustomWidth": {
        "title": "",
        "content": "windowStartCustomWidth → int : Get or set the window start width. Only used when windowStartMode is WindowStartMode.CUSTOM."
      },
      "windowStartCustomHeight": {
        "title": "",
        "content": "windowStartCustomHeight → int : Get or set the window start height. Only used when windowStartMode is WindowStartMode.CUSTOM."
      },
      "windowStartCustomX": {
        "title": "",
        "content": "windowStartCustomX → int : Get or set the window start X position. Only used when windowStartMode is WindowStartMode.CUSTOM."
      },
      "windowStartCustomY": {
        "title": "",
        "content": "windowStartCustomY → int : Get or set the window start Y position. Only used when windowStartMode is WindowStartMode.CUSTOM."
      },
      "performOnStart": {
        "title": "",
        "content": "performOnStart → bool : Get or set the perform on start state."
      },
      "performWindowPath": {
        "title": "",
        "content": "performWindowPath → OP : Get or set the perform window path."
      },
      "resetAudioOnDeviceChange": {
        "title": "",
        "content": "resetAudioOnDeviceChange → bool : Get or set whether audio devices momentarily reset when devices are added or removed to the system."
      },
      "Methods": {
        "title": "Methods",
        "content": ""
      },
      "load": {
        "title": "",
        "content": "load(path)→ None: Load a specific .toe file from disk.\npath - (Optional) The path of the file to load.  If not specified, loads the default.toe file, as specified in preferences.project.load('test_demo.toe')"
      },
      "save": {
        "title": "",
        "content": "save(path, saveExternalToxs=False)→ bool: Save the current session to disk.  Returns True if a file was saved, False otherwise (eg, if the file exists, and when prompted, the user selects to not overwrite).\npath - (Optional) If not provided the default/current filename is incremented and used. The current file is project.name under folder project.folder.\nsaveExternalToxs - (Keyword, Optional) If set to True, will save out the contents of any COMP that references an external .tox into the referenced .tox file.project.save('test_demo.toe')\nproject.save()"
      },
      "quit": {
        "title": "",
        "content": "quit(force=False, crash=False)→ None: Quit the project.\nforce - (Keyword, Optional) If set to True, unsaved changes will be discarded without prompting.\ncrash - (Keyword, Optional) If set to True, the application will terminate unexpectedly. This is used for system testing.project.quit()  #quit project, possibly prompting for unsaved changes if 'Prompt to Save on Exit' in Preferences dialog is enabled.\nproject.quit(force=True)  #quit project immediately."
      },
      "addPrivacy": {
        "title": "",
        "content": "addPrivacy(key)→ bool: Add privacy to a toe file with the given key.\nPrivacy can only be added to toes that currently have no privacy, and are using a Pro license.\n\nkey - The key phrase. This should resolve to a non-blank string.project.addPrivacy('secret')"
      },
      "removePrivacy": {
        "title": "",
        "content": "removePrivacy(key)→ bool: Completely remove privacy from a toe file.\nkey - The current privacy key phrase.project.removePrivacy('secret')"
      },
      "accessPrivateContents": {
        "title": "",
        "content": "accessPrivateContents(key)→ bool: Gain access to a private file. The file will still be private the next time it is saved or re-opened.\nkey - The current privacy key phrase.project.accessPrivateContents('secret')"
      },
      "applyWindowSettings": {
        "title": "",
        "content": "applyWindowSettings()→ None: Applies the project's window start settings to the current TouchDesigner window."
      },
      "stack": {
        "title": "",
        "content": "stack()→ str: Formatted contents of current cook and parameter evaluation stack.\nprint(project.stack())"
      },
      "pythonStack": {
        "title": "",
        "content": "pythonStack()→ str: Formatted contents of current python stack.\nprint(project.pythonStack()) TouchDesigner Build: Latest\\nwikieditor2022.241402021.100002018.28070before 2018.28070"
      }
    }
  }
}